app/controllers/classifier_controller.rb

  def consultas
  	@sentencia = params[:consulta]
  	b = Classifier::Bayes.new 'SoporteTecnico', 'Comercial'
    @lista_soporte = []
  	@soporte = SoporteTecnico.all
    i = 0
  	@soporte.each do |s|
  		b.train_SoporteTecnico s.consulta
      @lista_soporte[i] = s.consulta
      i+=1
  	end
    @lista_comercial = []
  	@comercial = Comercial.all
    i = 0
  	@comercial.each do |c|
  		b.train_Comercial c.consulta
      @lista_comercial [i] = c.consulta
      i+=1
  	end

  	if @sentencia != nil
  		@resultado = b.classify @sentencia
      if @resultado == "Soportetecnico"
        SoporteTecnico.create(consulta: @sentencia)
      elsif @resultado == "Comercial"
        Comercial.create(consulta: @sentencia)
---
SELECT "soporte_tecnicos".* FROM "soporte_tecnicos"
SELECT "comercials".* FROM "comercials"
INSERT INTO "soporte_tecnicos" ("consulta", "created_at", "updated_at") VALUES (?, ?, ?)  [["consulta", "Problema Tecnico"], ["created_at", "2014-06-22 15:25:09.933240"], ["updated_at", "2014-06-22 15:25:09.933240"]]
INSERT INTO "comercials" ("consulta", "created_at", "updated_at") VALUES (?, ?, ?)  [["consulta", "Problema Comercial"], ["created_at", "2014-06-22 15:25:24.940098"], ["updated_at", "2014-06-22 15:25:24.940098"]]

  def ver_consultas
    @lista_soporte = []
    @soporte = SoporteTecnico.all
    i = 0
    @soporte.each do |s|
      @lista_soporte[i] = s.consulta
      i+=1
    end
    @lista_comercial = []
    @comercial = Comercial.all
---
SELECT "soporte_tecnicos".* FROM "soporte_tecnicos"
SELECT "comercials".* FROM "comercials"